---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.FittingAnnotationSize
source: html/6b0c6492-4c82-ce34-4f0f-544a0b3f65f1.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.FittingAnnotationSize Property

The value of fitting annotation size.

## Syntax (C#)
```csharp
public double FittingAnnotationSize { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for dValue must be no more than 30000 feet in absolute value.